---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireSizeSet
source: html/e2a17c63-16e8-3c61-54c3-37e9d5d2fa3d.htm
---
# WireSizeSet Methods

Removes every wire size from the set, rendering it empty.